/*
	File:		ResultsViewStrings.strings

	Contains:
	Copyright:	© 2007-2009 by Apple Inc., all rights reserved.
*/

"SEARCH_WINDOW_RESULTS_COUNT_SINGULAR" = "%d tulos"; /* This will be used when the count is 1 */
"SEARCH_WINDOW_RESULTS_COUNT" = "%d tulosta";
"SEARCH_WINDOW_RESULTS_NO_COUNT" = "Tulokset";
"SEARCH_WINDOW_RESULTS_NO_RESULTS" = "Ei tuloksia";

"SHOW_ALL_N" = "Näytä kaikki %d";
"SHOW_TOP_COUNT" = "Näytä %d parasta";
"MORE_TITLE_FORMAT" = "Lisää…";

"PREVIEW_TRASH" = "Roskakori";
"PREVIEW_WHERE" = "Sijainti";
"PREVIEW_ITUNES_LIBRARY" = "iTunes-musiikkikirjasto";
"PREVIEW_MESSAGE_FROM" = "Lähettäjä";
"PREVIEW_MESSAGE_TO" = "Vastaanottaja";
"PREVIEW_MESSAGE_RECIEVED" = "Vastaanotettu";
"PREVIEW_MESSAGE_SUBJECT" = "Aihe";
"PREVIEW_MESSAGE_FOLDER" = "Kansio";
"PREVIEW_DIMENSIONS" = "Mitat";
"PREVIEW_PIXEL_DIMENSIONS" = "%@ x %@ pikseliä";   /* Dimensions in pixels */
"PREVIEW_POINT_DIMENSIONS" = "%@ x %@ pistettä";   /* Dimensions in points */
"PREVIEW_POINT_INCH_DIMENSIONS" = "%@ x %@ tuumaa";  /* Dimensions in inches */
"PREVIEW_POINT_CM_DIMENSIONS"  = "%@ x %@ cm";   /* Dimensions in centimeters */
"PREVIEW_ICAL_LOCATION" = "Sijainti";
"PREVIEW_ICAL_CALENDAR" =  "Kalenteri";
"PREVIEW_ICAL_START_DATE" = "Alkamispäivä";
"PREVIEW_ICAL_DUE_DATE" = "Määräpäivä";
"PREVIEW_ICAL_ATTENDEES" = "Osanottajat";
"PREVIEW_ARTICLE_POSTED" = "Lähetetty";
"PREVIEW_BOOLEAN_TRUE" = "kyllä";
"PREVIEW_BOOLEAN_FALSE" = "ei";

/* Used in the bottom preview in the Show all window, both of these strings are used in a stringWithFormat: and i pass along
 * the number of items
 */
"PREVIEW_NOTHING_SELECTED_SINGULAR" = "Ei mitään valittu";
"PREVIEW_NOTHING_SELECTED_PLURAL" = "%d kohdetta valittu";
"PREVIEW_ONE_SELECTED" = "1 kohde valittu";

"NO_MAIL_SUBJECT" = "Ei aihetta";

"FIELD_INDEXING_DISKS_TOOLTIP" = "Indeksoidaan taltioita (%d %% suoritettu)";
"FIELD_INDEXING_TOOLTIP_CALCULATING" = "Indeksoidaan taltioita";

/* Date link attributes */
"LINK_SEARCH_DATE" = "Etsi kohteesta %@";
"LINK_SEARCH_DATE_RANGE" = "Viikko %@ - %@";
"LINK_SEARCH_MONTH_RANGE" = "Kuukausi %@ - %@";
"LINK_SEARCH_YEAR_RANGE" = "Vuosi %@ - %@";
"LINK_SEARCH_DATE_NEWER" = "Uudempi kuin %@";

/* This is used as the separator between the name and the directory component in the Search menu */
"EMDASH" = "-";

/* These are titles for the Save/Edit saved search button in the scope bar. */
"SAVED_SEARCH_EDIT" = "Muokkaa";
"SAVED_SEARCH_SAVE" = "Tallenna";

/* button bar labels */
"SEARCH_WINDOW_PREVIEW_BUTTON" = "Esikatsele";

"TEXT_SNIPPET_RANGE_SEPARATOR" = "…";

"KIND_MAIL_MSG" = "Sähköpostiviesti";
"KIND_ICAL_EVENT" = "iCal-tapahtuma";
"KIND_ICAL_TODO" = "iCal-tehtävä";

"SEARCH_NAME_AND_ATTRIBUTES" = "Nimi ja ominaisuudet";
"SEARCH_NAME_ONLY" = "Vain nimi";
"SEARCH_ADVANCED" = "Lisävalinnat";

/* the 'other...' menu item is used to bring up panel of other attributes to choose from. */
"OTHER_ATTRIBUTE_SLICE_MENU" = "Muu…";

/* raw query slice support.  The raw query slice appears when you select it from the other... drop down in the advanced search */
"RAW_QUERY_SLICE_NAME" = "Puhdas haku";
"RAW_QUERY_SLICE_DESCRIPTION" = "Hakuun sisällytettävä käsittelemätön hakupredikaatti";

/* file extension slice support.  The file extension slice appears when you select it from the other... drop down in the advanced search */
"FILE_EXTENSION_SLICE_NAME" = "Tiedostotarkenne";
"FILE_EXTENSION_SLICE_DESCRIPTION" = "Kohteen tiedostotarkenne";

/* system files slice support.  The system files slice appears when you select it from the other... drop down in the advanced search */
"SYSTEM_FILES_SLICE_NAME" = "Järjestelmätiedostot";
"SYSTEM_FILES_SLICE_DESCRIPTION" = "Sisältää järjestelmätiedostot, kuten asetustiedostot ja liitännäiset";

/* spotlight items slice support.  The spotlight items slice appears when you select it from the other... drop down in the advanced search */
"SPOTLIGHT_ITEMS_SLICE_NAME" = "Spotlight-kohteet";
"SPOTLIGHT_ITEMS_SLICE_DESCRIPTION" = "Sisältää yhteystiedot, sähköpostit, tapahtumat, verkkosivut ja muuta";

/* titles for additional columns */
"CATEGORY_COLUMN_TITLE" = "Kategoria";
